package day02;

public class StaticNotes {

}
/*
static静态关键字：
1. 被static修饰的成员变量，静态变量，被该类所有对象共享（类名调用，对象名调用）
   不属于对象，属于类；  随着类的加载而加载，优先于对象存在
2. 被static修饰的成员方法，静态方法，多用在 测试类 和 工具类(只调用，不创建） 中,javabean类中很少会用
   类名/对象名调用

注意：1. 静态方法只能访问静态
     2. 非静态方法 可访问所有

     3. 静态方法中无this关键字

重识main方法中的static作用：
     1. 被jvm调用，不用创建对象，直接类名访问
     2. 因为main方法是静态的，所以测试类中其他方法也需要是静态的

 */

/*
1. javabean类：用来描述一类事物的类，eg: Student , Teacher, Dog
2. 测试类：用来检查其他类是否书写正确，带有main方法的类，程序的入口
3. 工具类： 不用来描述一类事物，而是帮我们做一些事情的类（函数）。
           类名见名知意，  私有化构造方法（不需要对象）
           方法定义为静态
 */

